[
  {
    "pergunta": "O que é ecologia?",
    "resposta": "Ecologia é o estudo científico das interações entre os organismos e seu ambiente, tanto biótico (seres vivos) quanto abiótico (fatores não vivos)."
  },
  {
    "pergunta": "Quais são os principais níveis de organização em ecologia?",
    "resposta": "Os principais níveis são: organismo, população, comunidade, ecossistema e biosfera."
  },
  {
    "pergunta": "O que é um ecossistema?",
    "resposta": "Um ecossistema é um sistema ecológico formado pela interação de uma comunidade de organismos vivos com seu ambiente físico."
  },
  {
    "pergunta": "Qual a diferença entre fatores bióticos e abióticos?",
    "resposta": "Fatores bióticos são os componentes vivos de um ecossistema (plantas, animais, fungos, bactérias), enquanto fatores abióticos são os componentes não vivos (luz solar, temperatura, água, solo, nutrientes)."
  },
  {
    "pergunta": "O que é uma cadeia alimentar?",
    "resposta": "Uma cadeia alimentar é uma sequência linear de organismos onde cada um serve de alimento para o seguinte, mostrando o fluxo de energia em um ecossistema."
  },
  {
    "pergunta": "O que é uma teia alimentar?",
    "resposta": "Uma teia alimentar é um conjunto interconectado de várias cadeias alimentares em um ecossistema, representando as relações alimentares mais complexas."
  },
  {
    "pergunta": "Explique o conceito de nicho ecológico.",
    "resposta": "O nicho ecológico é o papel funcional de uma espécie em um ecossistema, incluindo seu habitat, seus recursos utilizados, suas interações com outras espécies e suas condições ambientais de sobrevivência."
  },
  {
    "pergunta": "Quais são os principais tipos de interações ecológicas entre espécies?",
    "resposta": "As principais interações são: competição, predação, parasitismo, mutualismo e comensalismo."
  },
  {
    "pergunta": "Descreva o ciclo de nutrientes em um ecossistema.",
    "resposta": "O ciclo de nutrientes envolve a circulação e a reutilização de elementos essenciais (como carbono, nitrogênio e fósforo) através dos componentes bióticos e abióticos de um ecossistema."
  },
  {
    "pergunta": "O que é sucessão ecológica?",
    "resposta": "Sucessão ecológica é o processo gradual e direcional de mudança na estrutura de espécies de uma comunidade ao longo do tempo."
  },
  {
    "pergunta": "Qual a importância da biodiversidade?",
    "resposta": "A biodiversidade é crucial para a estabilidade e o funcionamento dos ecossistemas, fornecendo serviços ecossistêmicos essenciais como polinização, purificação da água, regulação do clima e recursos naturais."
  },
  {
    "pergunta": "Explique o conceito de capacidade de carga de um ambiente.",
    "resposta": "A capacidade de carga é o número máximo de indivíduos de uma determinada espécie que um ambiente pode suportar indefinidamente, dados os recursos disponíveis."
  },
  {
    "pergunta": "Como as mudanças climáticas afetam a distribuição e a fenologia das espécies?",
    "resposta": "As mudanças climáticas alteram as condições ambientais (temperatura, precipitação), levando a deslocamentos geográficos de espécies em busca de habitats adequados e a alterações em eventos sazonais como floração e migração."
  },
  {
    "pergunta": "Discuta os mecanismos de regulação populacional em ecossistemas complexos.",
    "resposta": "A regulação populacional envolve fatores dependentes da densidade (competição, predação, doenças) e fatores independentes da densidade (eventos climáticos, desastres naturais) que influenciam o tamanho das populações."
  },
  {
    "pergunta": "Analise a relação entre a estrutura trófica de um ecossistema e sua resiliência a perturbações.",
    "resposta": "Ecossistemas com maior diversidade trófica (mais cadeias e teias alimentares interconectadas) tendem a ser mais resilientes a perturbações, pois a perda de uma espécie pode ser compensada por outras com funções semelhantes."
  },
  {
    "pergunta": "Como a fragmentação de habitats impacta a biodiversidade e os processos ecológicos?",
    "resposta": "A fragmentação de habitats reduz o tamanho das áreas contínuas, isola populações, aumenta o efeito de borda e dificulta o movimento de espécies, levando à perda de biodiversidade e à alteração de processos como polinização e dispersão de sementes."
  },
  {
    "pergunta": "Avalie a importância dos serviços ecossistêmicos para a sociedade humana e os desafios na sua valoração econômica.",
    "resposta": "Os serviços ecossistêmicos (fornecimento, regulação, suporte e culturais) são essenciais para o bem-estar humano. A valoração econômica é desafiadora devido à natureza pública e não mercantil de muitos desses serviços, mas é crucial para sua consideração em tomadas de decisão."
  },
  {
    "pergunta": "Discuta os modelos ecológicos utilizados para prever a dinâmica de populações e comunidades sob diferentes cenários ambientais.",
    "resposta": "Modelos ecológicos (matemáticos e computacionais) são usados para simular e prever a dinâmica populacional, as interações entre espécies e as respostas dos ecossistemas a mudanças ambientais, auxiliando na conservação e no manejo."
  }
]